flimmy78/MXN003_FACTORY/nRF5_SDK_12.3.0_d7731ad/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/mxn003/main.c
/**@brief Function for handling the YYY Service events.
 * YOUR_JOB implement a service handler function depending on the event the service you are using can generate
 *
 * @details This function will be called for all YY Service events which are passed to
 *          the application.
 *
 * @param[in]   p_yy_service   YY Service structure.
 * @param[in]   p_evt          Event received from the YY Service.
 *
 *
   static void on_yys_evt(ble_yy_service_t     * p_yy_service,
                       ble_yy_service_evt_t * p_evt)
   {
    switch (p_evt->evt_type)
    {
        case BLE_YY_NAME_EVT_WRITE:
            APPL_LOG("[APPL]: charact written with value %s. \r\n", p_evt->params.char_xx.value.p_str);
            break;

        default:
            // No implementation needed.
            break;
    }
   }*/
	 static void U_PutUARTBytes(uint8_t *data,uint16_t len)
{
   uint16_t index;

   for(index = 0; index < len; index++)
			while(app_uart_put(*(data+index)) != NRF_SUCCESS);
}

static void U_PutUARTByte(char * fmt, int size){
	U_PutUARTBytes((uint8_t*)fmt, size);
	U_PutUARTBytes((uint8_t*)"\r\n", 2);
}


static void PutUARTBytes(const char *fmt, ...)
{
    static char logCbuf[1024];
    va_list args;
    char *p;
    int n, m;

    memset(logCbuf, 0, 1024);
    p = logCbuf;
    m = 1020;
    va_start(args, fmt);
    n = vsnprintf(p, m, fmt, args);
    va_end(args);

    U_PutUARTByte(logCbuf, n);
}

static void uart_getline(uint8_t * line,uint32_t timeout)
{
    uint8_t i = 0, ch = 0;
    uint32_t err_code;

		do {
			err_code = app_uart_get(&ch);
			if (NRF_ERROR_NOT_FOUND == err_code)
			{
					if(timeout-- > 0){
						nrf_delay_ms(1000);
						sd_app_evt_wait();
					}else{
						break;
					}
			}
			else if (NRF_SUCCESS == err_code)   
			{
				line[i++] = ch;
			}
			else
			{
				APP_ERROR_CHECK(err_code);
			}
		}
		while (ch != '\n');
}


static void get_uart_responese(uint8_t * command_buffer)
{
		uart_getline(command_buffer,3);
}

static void uart_enable(int8_t on)
{
	if(1 == on){
	 NRF_UART0->ENABLE        = (UART_ENABLE_ENABLE_Enabled << UART_ENABLE_ENABLE_Pos);
   NRF_UART0->TASKS_STARTRX = 1;
   NRF_UART0->TASKS_STARTTX = 1;
	}else{
		NRF_UART0->TASKS_STOPTX = 1;
		NRF_UART0->TASKS_STOPRX = 1;
		NRF_UART0->ENABLE       = (UART_ENABLE_ENABLE_Disabled << UART_ENABLE_ENABLE_Pos);
	}
}

custom_rsp_type_enum custom_mod_func(custom_cmdLine *commandBuffer_p){
	
	NRF_LOG_INFO("custom_mod_func\r\n");
	nrf_gpio_pin_write(MODME_CONTRL_PIN, 0);
	uart_enable(1);
	nrf_delay_ms(200);
	//PutUARTBytes("AT+EVERN");
	//ble_nus_string_send(&m_nus,	(uint8_t *)"custom_mod_func", sizeof("custom_mod_func"));
	
		while(1){
			uint8_t cmd_buffer[20] = {0};
			get_uart_responese(cmd_buffer);
			if(cmd_buffer[0] == 0){
				NRF_LOG_INFO("get buff null \r\n");
				NRF_LOG_FLUSH();
				break;
			}
			NRF_LOG_INFO("data::%s\r\n",(uint32_t)cmd_buffer);
			NRF_LOG_FLUSH();
	
			if(strstr((const char *)cmd_buffer, "xfdf") != NULL){
				ble_nus_string_send(&m_nus, cmd_buffer, sizeof(cmd_buffer));
				return CUSTOM_RSP_OK;
			}
		}
			
	return CUSTOM_RSP_OK;
}

const custom_atcmd custom_cmd_table[ ] =
{
	//{"AP+VOICE",custom_voice_func},
	{"AP+MOD",custom_mod_func},
//	{"AP+SWVER",custom_modem_version_func},
//	{"AP+EGPSON",custom_open_gps_func},
//	{"AP+EGPSOFF",custom_close_gps_func},
//	{"AP+EGPSGET",custom_get_gps_data_func},
	{NULL, NULL}
};

static bool app_data_hdlr(char *full_cmd_string,uint16_t length)
{
		char buffer[20];
		char *cmd_name, *cmdString;
		uint8_t index = 0; 
		uint16_t i;
		custom_cmdLine command_line;
		cmd_name = buffer;
		length = length > 20 ? 20 : length;  
	
		while ((full_cmd_string[index] != '=' ) &&  //might be TEST command or EXE command
				(full_cmd_string[index] != '?' ) && // might be READ command
				(full_cmd_string[index] != 13 ) && //carriage return
		index < length)  
		{
			cmd_name[index] = full_cmd_string[index] ;
			index ++;
		}
		cmd_name[index] = '\0' ;  
		
		for (i = 0 ; custom_cmd_table[i].commandString != NULL; i++ )
		{
			cmdString = custom_cmd_table[i].commandString;
			if (strcmp(cmd_name, cmdString) == 0 ){
					strncpy(command_line.character, full_cmd_string, 20);
					command_line.character[19] = '\0';
					command_line.length = strlen(command_line.character);
					command_line.position = index;
					if (custom_cmd_table[i].commandFunc(&command_line) == CUSTOM_RSP_OK) {
							//	ble_nus_string_send(&m_nus, re_Data, sizeof(re_Data));
						}else{
							//	ble_nus_string_send(&m_nus, re_Data1, sizeof(re_Data1));
            }
					return true;
			}
		}
		
		return true;
		
}

static void nus_data_handler(ble_nus_t * p_nus, uint8_t * p_data, uint16_t length)
{
		app_data_hdlr((char *)p_data, length);
		memset(p_data, 0, sizeof(uint8_t)*length);
}
/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
	  uint32_t       err_code;
    ble_dis_init_t dis_init;
		ble_nus_init_t nus_init;
	
	 // Initialize nus Service.
		memset(&nus_init, 0, sizeof(nus_init));
		nus_init.data_handler = nus_data_handler;
	
		err_code = ble_nus_init(&m_nus, &nus_init);
    APP_ERROR_CHECK(err_code);
	
	// Initialize Device Information Service.
		memset(&dis_init, 0, sizeof(dis_init));

		ble_srv_ascii_to_utf8(&dis_init.manufact_name_str, (char *)MANUFACTURER_NAME);

		BLE_GAP_CONN_SEC_MODE_SET_OPEN(&dis_init.dis_attr_md.read_perm);
		BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&dis_init.dis_attr_md.write_perm);

		err_code = ble_dis_init(&dis_init);
		APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

